Repository: AOSC-Tracking/PackageKit
Catalog: po/*.po
Languages: de, se, th

source: Update detail
de: Details werden aktualisiert
se: Uppdatera detaljer
th: รายละเอียดการอัปเดต

source: A system restart is required
de: Ein Neustart ist erforderlich
se: En omstart är nödvändig
th: ต้องเริ่มต้นระบบใหม่

source: A logout and login is required
de: Ein Aus- und Einloggen ist erforderlich
se: En ny inloggning är nödvändig
th: ต้องออกจากระบบและเข้าสู่ระบบใหม่

source: An application restart is required
de: Ein Programm-Neustart wird benötigt
se: En omstart av programmet är nödvändig
th: ต้องเริ่มต้นโปรแกรมใหม่

source: There are multiple package matches
de: Es passen mehrere Packete zu Ihrer Anfrage
se: Det finns flera paket som matchar
th: มีแพคเกจที่ตรงกันหลายตัว

source: Please enter the package number:
de: Bitte geben Sie die Packet-Nummer ein:
se: Var snäll skriv in paketets nummer:
th: กรุณาป้อนหมายเลขแพคเกจ:

source: Could not find package to install
de: Packet zum Installieren konnte nicht gefunden werden
se: Kunde inte hitta paketet att installera

source: Could not find package to remove
de: Packet zum Löschen konnte nicht gefunden werden
se: Kunde inte hitta paketet att ta bort

source: The following packages have to be removed
de: Die folgenden Packeten müssen entfernt werden
se: Följande paket måste tas bort
th: แพคเกจต่อไปนี้จะถูกถอดถอน

source: Okay to remove additional packages?
de: Sollen die zusätzlichen Packete entfernt werden?
se: Är det ok att ta bort dessa extra paket?
th: ต้องการถอดแพคเกจเพิ่มเติม?

source: Cancelled!
de: Abbruch!
se: Avbruten!
th: ถูกยกเลิก!

source: Could not find package to download
de: Das Packet zum Herunterladen konnte nicht gefunden werden
se: Kunde inte hitta paketet att ladda ner

source: Could not find package to update
de: Das Packet zum Aktualisieren konnte nicht gefunden werden
se: Kunde inte hitta paketet att uppdatera

source: Could not find what packages require
de: Konnte nicht herausfinden, was die Packete benötigen
se: Kunde inte hitta vad paketet behöver

source: Could not get dependencies for
de: Konnte keine Abhängigkeiten bekommen für
se: Kunde inte hämta beroenden för

source: Could not find details for
de: Konnte keine Details finden für
se: Kunde inte hitta detaljer om

source: Could not find the files for this package
de: Die Dateien für dieses Packet konnten nicht gefunden werden
se: Kunde inte hitta filerna för detta paket
th: ไม่สามารถค้นหาไฟล์สำหรับแพคเกจนี้

source: Could not get the file list
de: Die Datei-Liste konnte nicht erstellt werden
se: Kunde inte hämta fillistan

source: Could not find the update details for
de: Konnte keine Aktualisierungsdetails nicht finden für
se: Kunde inte hitta detaljerna om uppdateringen för

source: Package description
de: Packet-Beschreibung
se: Paketets beskrivning
th: รายละเอียดแพคเกจ

source: Package files
de: Packet-Dateien
se: Paketets filer
th: ไฟล์แพคเกจ

source: No files
de: Keine Dateien
se: Inga filer
th: ไม่มีไฟล์

source: Okay to import key?
de: Soll der Schlüssel importiert werden?
se: Är det Ok att importera nyckeln?
th: ต้องการนำเข้ากุญแจ?

source: Did not import key
de: Schlüssel wurde nicht importiert
se: Importerade inte nyckeln
th: ไม่ได้นำเข้ากุญแจ

source: Do you agree?
de: Sind Sie einverstanden?
se: Godkänner du?
th: ยอมรับข้อความข้างต้น?

source: Did not agree to licence, task will fail
de: Sie stimmten der Lizenz nicht zu, die Aufgabe wird fehlschlagen
se: Godkände inte licensen, uppgiften kommer misslyckas
th: ไม่ยอมรับข้อตกลงสัญญาอนุญาต งานที่ทำจะล้มเหลว

source: The daemon crashed mid-transaction!
de: Der Dämon stürzte während der Transaktion ab!
se: Daemonen kraschade under transaktionen
th: ดีมอนขัดข้องระหว่างกระบวนการ!

source: PackageKit Console Interface
de: PackageKit-Konsolen-Interface
se: PackageKits Konsolgränssnitt
th: ส่วนติดต่อบนคอนโซลของ PackageKit

source: Subcommands:
de: Unterbefehle:
se: Underkommandon
th: คำสั่งย่อย:

source: Show extra debugging information
de: Zeige extra Debup-Informationen
se: Visa ytterligare debuginformation
th: แสดงข้อมูลเพิ่มเติมสำหรับดีบั๊ก

source: Show the program version and exit
de: Zeige Programm-Version und beende
se: Visa versionen av programmet och avsluta
th: แสดงรุ่นของโปรแกรมแล้วออก

source: Set the filter, e.g. installed
de: Setze den Filter, z.B. installiert
se: Sätt filtret, t ex installerat
th: ตั้งตัวกรอง เช่น ติดตั้งไว้แล้ว

source: Exit without waiting for actions to complete
de: Beende, ohne auf Beendigung der Aktionen zu warten
se: Avsluta utan att vänta på att åtgärder ska slutföras
th: ออกโดยไม่ต้องรอกระบวนการให้เสร็จสิ้น

source: Could not connect to system DBUS.
de: Konnte nicht zum System-DBUS verbinden
se: Kunde inte ansluta till systemets DBUS
th: ไม่สามารถต่อกับ DBUS ของระบบ

source: You need to specify a search type, e.g. name
de: Sie müssen einen Suchtyp angeben, z.B. einen Namen
se: Du måste ange en söktyp, t ex namn

source: You need to specify a search term
de: Sie müssen einen Suchwert angeben
se: Du måste ange en sökterm
th: คุณต้องระบุคำค้นหา

source: Invalid search type
de: Ungültiger Suchtyp
se: Ogiltig söktyp
th: ชนิดการค้นหาไม่ถูกต้อง

source: You need to specify a package or file to install
de: Sie müssen ein Packet oder eine Datei zum Installieren angeben
se: Du måste ange ett paket eller fil att installera
th: คุณต้องระบุแพคเกจหรือไฟล์ที่จะติดตั้ง

source: You need to specify a type, key_id and package_id
de: Sie müssen einen Typ, Schlüssel_id und Packet_id auswählen
se: Du måste ange en typ, key_id och package_id
th: คุณต้องระบุชนิด, key_id และ package_id

source: You need to specify a package to remove
de: Sie müssen ein Packet zum Löschen angeben
se: Du måste ange ett paket att ta bort
th: คุณต้องระบุแพคเกจที่จะถอดถอน

source: You need to specify the destination directory and then the packages to download
de: Sie müssen ein Zielverzeichnis und dann die Packete zum Herunterladen angeben
se: Du måste ange målmappen och paketen att ladda ner

source: Directory not found
de: Verzeichnis nicht gefunden
se: Mappen kunde inte hittas

source: You need to specify a eula-id
de: Sie müssen eine eula-id auswählen
se: Du måste ange ett eula-id
th: คุณต้องระบุ eula-id

source: You need to specify a package name to resolve
de: Sie müssen einen Packetnamen zum Auflösen angeben
se: Du måste ange ett namn att söka efter

source: You need to specify a repo name
de: Sie müssen einen Repository-Namen angeben
se: Du måste ange ett "reponamn"
th: คุณต้องระบุชื่อคลัง

source: You need to specify a repo name/parameter and value
de: Sie müssen einen Repositorynamen/Parameter und Wert angeben
se: Du måste ange ett "reponamn"/parameter och värde
th: คุณต้องระบุชื่อคลัง/พารามิเตอร์และค่า

source: You need to specify a time term
de: Sie müssen einen Zeit-Begriff angeben
se: Du måste ange en tidsperiod

source: You need to specify a correct role
de: Sie müssen eine korrekte Rolle angeben
se: Du måste ange en korrekt roll
th: คุณต้องระบุหน้าที่ที่ถูกต้อง

source: Failed to get last time
de: Die letzte Zeit konnte nicht herausgefunden werden
se: Misslyckades att hämta senaste gången
th: ไม่สามารถหาเวลาล่าสุด

source: You need to specify a package to find the details for
de: Sie müssen ein Packet, für das nach Details gesucht wird, angeben
se: Då måste ange ett paket att hitta detaljer om
th: คุณต้องระบุแพคเกจที่จะค้นหารายละเอียด

source: You need to specify a package to find the files for
de: Sie müssen ein Packet, für das nach Dateien gesucht wird, angeben
se: Då måste ange ett paket att hitta filer till
th: คุณต้องระบุแพคเกจที่จะค้นหาไฟล์

source: Option '%s' not supported
de: Optino '%s' nicht unterstützt
se: Alternativet '%s' stöds ej
th: ไม่รองรับตัวเลือก '%s'

source: You don't have the necessary privileges for this operation
de: Sie haben nicht die notwendigen Privilegien für diese Operation
se: Du har inte nädvändiga privilegier för denna operation
th: คุณมีสิทธิไม่เพียงพอสำหรับกระบวนการนี้

source: Command failed
de: Befehl fehlgeschlagen
se: Kommandot misslyckades
th: คำสั่งล้มเหลว

source: Could not find a package match
de: Es konnte kein Packet gefunden werden
se: Kunde inte hitta ett matchande paket
th: ไม่สามารถหาแพคเกจที่ตรงกันได้

source: failed to download: invalid package_id and/or directory
se: misslyckades att ladda ner: ogiltigt package_id och/eller mapp

source: Could not find a valid metadata file
se: Kunde inte hitta en giltig fil för metadata

source: Okay to download the additional packages
se: Ok att ladda ner dessa extra paket

source: Set the path of the file with the list of packages/dependencies to be excluded
se: Sätt sökvägen till filen med listan över paket/beroenden att exkludera

source: You need to specify the pack name and packages to be packed
se: Du måste ange packnamnet och paketen att packa

source: Invalid name for the service pack, Specify a name with .servicepack extension
se: Ogiltigt namn för servicepacket, Ange ett namn som har filändeslen .servicepack

source: A pack with the same name already exists, do you want to overwrite it?
de: Ein Pack mit dem selben Namen existiert bereits, möchten Sie es überschreiben?
se: Ett pack med samma namn existerar redan, vill du skriva över det?

source: Failed to create directory
de: Verzeichnis konnte nicht erstellt werden
se: Misslyckades med att skapa mapp

source: Failed to create pack
se: Misslyckades med att skapa pack

source: Could not set database readonly
de: Datenbank konnte nicht nur-lesbar gesetzt werden
se: Kunde inte ställa in databasen till endast läsbar

source: Could not open database: %s
de: Datenbank %s konnte nicht geöffnet werden
se: Kunde inte öppna databasen: %s
th: ไม่สามารถเปิดฐานข้อมูล: %s

source: You probably need to run this program as the root user
de: Sie sollten dieses Programm vermutlich als Benutzer root ausführen
se: Du måste troligtvis köra detta program som rootanvändare
th: คุณอาจจะต้องรันโปรแกรมนี้เป็นผู้ใช้รูท

source: PackageKit Monitor
se: PackageKit Övervakare
th: โปรแกรมเฝ้าสังเกต PackageKit

source: Please enter a number from 1 to %i:
de: Bitte geben Sie eine Zahl zwischen 1 und %i ein:
se: Var snäll skriv in ett nummer frpn 1 till %i:
th: กรุณาป้อนตัวเลขจาก 1 ถึง %i:

source: Getting package information...
de: Bekomme Packet-Informationen...
se: Hämtar paketinformation

source: <span color='#%06x' underline='single' size='larger'>Run %s</span>
de: <span color='#%06x' underline='single' size='larger'>%s wird ausgeführt</span>
se: <span color='#%06x' underline='single' size='larger'>Starta %s</span>

source: <small>Installed version: %s</small>
de: <small>Installierte Version: %s</small>
se: <small>Installerade versioner: %s</small>

source: <span color='#%06x' underline='single'>Run version %s now</span>
de: <span color='#%06x' underline='single'>Version %s wird jetzt ausgeführt</span>
se: <span color='#%06x' underline='single'>Kör version %s now</span>

source: <span color='#%06x' underline='single'>Run now</span>
de: <span color='#%06x' underline='single'>Wird jetzt ausgeführt</span>
se: <span color='#%06x' underline='single'>Starta nu</span>

source: <span color='#%06x' underline='single'>Upgrade to version %s</span>
de: <span color='#%06x' underline='single'>Aktualisiere zu Version %s</span>
se: <span color='#%06x' underline='single'>Uppgradera till version %s</span>

source: <span color='#%06x' underline='single' size='larger'>Install %s Now</span>
de: <span color='#%06x' underline='single' size='larger'>%s wird jetzt installiert</span>
se: <span color='#%06x' underline='single' size='larger'>Installera %s Nu</span>

source: <small>No packages found for your system</small>
de: <small>Es wurden keine Packete für Ihren Rechner gefunden</small>
se: <small>Inga paket hittades till ditt system</small>

source: <small>Installing...</small>
de: <small>Installiere...</small>
se: <small>Installerar...</small>

source: PackageKit Catalog
de: PackageKit Katalog
se: PackageKits Katalog

source: Startup failed due to security policies on this machine.
de: Startfehler wegen Sicherheitseinstellungen auf diesem Rechner
se: Uppstart misslyckades på grund aav säkerhetsinställningar på denna maskin.
th: การเริ่มโปรแกรมไม่สำเร็จเนื่องจากนโยบายด้านความปลอดภัยบนเครื่องนี้

source: This can happen for two reasons:
de: Dies kann aus zwei Gründen passieren:
se: Detta kan hända på grund av två skäl:
th: นี่อาจจะเกิดจากสองสาเหตุ:

source: The correct user is not launching the executable (usually root)
de: Der korrekte Benutzer führt nicht das Programm aus (normalerweise root)
se: Rätt användare startar inte programmet (oftast root)
th: ผู้ใช้ที่ถูกต้องไม่ได้เรียกโปรแกรม (ปกติคือ root)

source: The org.freedesktop.PackageKit.conf file is not installed in the system /etc/dbus-1/system.d directory
de: Die org.freedesktop.PackageKit.conf-Datei ist nicht auf Ihrem Rechner im Verzeichnis /etc/dbus-1/system.d installiert.
se: Filen org.freedesktop.PackageKit.conf är inte installerad i systemmappen /etc/dbus-1/system.d
th: ไฟล์ org.freedesktop.PackageKit.conf file ไม่ได้ถูกติดตั้งในไดเรคทอรี /etc/dbus-1/system.d

source: Packaging backend to use, e.g. dummy
se: Paketerar bekändet att använda, t ex dummy
th: แบ็คเอนด์ตัวจัดการแพคเกจที่จะใช้ เช่น dummy

source: Daemonize and detach from the terminal
de: Dämonisiere und löse vom Terminal ab
se: Bli en daemon och koppla fri från konsolen
th: เปลี่ยนเป็นดีมอนและแยกตัวออกจากเทอร์มินัล

source: Disable the idle timer
se: Avaktivera sysslolöshetstimern
th: ปิดไทเมอร์ที่ไม่ใช้งาน

source: Show version and exit
de: Zeige Version und beende
se: Visa version och avsluta
th: แสดงรุ่นแล้วออก

source: Exit after a small delay
de: Beende nach kurzer Verzögerung
se: Avsluta efter ett litet uppehåll
th: ออกหลังจากหน่วงเวลาเล็กน้อย

source: Exit after the engine has loaded
se: Avsluta efter att motorn har laddats
th: ออกหลังจาก engine ถูกเรียกแล้ว

source: Cannot connect to the system bus
de: Konnte nicht zum System-Bus verbinden
se: Kan inte ansluta till systembussen
th: ไม่สามารถติดต่อกับบัสระบบ

source: Error trying to start: %s
de: Fehler beim Starten von: %s
se: Misslyckades med att starta: %s
th: เกิดข้อผิดพลาดขณะจะเริ่ม: %s

source: Accept EULA
th: ยอมรับข้อตกลงสัญญาอนุญาต

source: Authentication is required to accept a EULA
th: ต้องยึนยันตัวเพื่อยอมรับข้อตกลงสัญญาอนุญาต

source: Authentication is required to change software source parameters
th: ต้องยึนยันตัวเพื่อเปลี่ยนแปลงพารามิเตอร์คลังซอฟต์แวร์

source: Authentication is required to install a local file
th: ต้องยึนยันตัวเพื่อติดตั้งไฟล์บนเครื่อง

source: Authentication is required to install a package
th: ต้องยึนยันตัวเพื่อติดตั้งแพคเกจ

source: Authentication is required to install a security signature
th: ต้องยึนยันตัวเพื่อติดตั้งลายเซ็นรับรองความปลอดภัย

source: Authentication is required to refresh the package lists
th: ต้องยึนยันตัวเพื่อเรียกรายการแพคเกจใหม่

source: Authentication is required to remove packages
th: ต้องยึนยันตัวเพื่อถอดแพคเกจ

source: Authentication is required to rollback a transaction
th: ต้องยึนยันตัวเพื่อยกเลิกการดำเนินการ

source: Authentication is required to update all packages
th: ต้องยึนยันตัวเพื่ออัปเดตแพคเกจทั้งหมด

source: Authentication is required to update packages
th: ต้องยึนยันตัวเพื่ออัปเดตแพคเกจ

source: Change software source parameters
th: เปลี่ยนแปลงพารามิเตอร์คลังซอฟต์แวร์

source: Further authentication is required to install an untrusted local file
th: ต้องยึนยันตัวเพื่อติดตั้งไฟล์ที่ไม่น่าเชื่อถือบนเครื่อง

source: Install local file
th: ติดตั้งแพคเกจบนเครื่อง

source: Install package
th: ติดตั้งแพคเกจ

source: Install security signature
th: ติดตั้งลายเซ็นรับรองความปลอดภัย

source: Install untrusted local file
th: ติดตั้งไฟล์ที่ไม่น่าเชื่อถือบนเครื่อง

source: Refresh package lists
th: เรียกรายการแพคเกจใหม่

source: Remove package
th: ถอดแพคเกจ

source: Rollback to a previous transaction
th: ถอยกลับไปยังการดำเนินการก่อนหน้า

source: Update all packages
th: อัปเดตแพคเกจทั้งหมด

source: Update package
th: อัปเดตแพคเกจ

source: Could not find a package with that name to install, or package already installed
th: ไม่สามารถค้นหาแพคเกจชื่อดังกล่าวเพื่อติดตั้ง หรือแพคเกจดังกล่าวถูกติดตั้งไว้อยู่แล้ว

source: Could not find a package with that name to remove
th: ไม่สามารถค้นหาแพคเกจดังกล่าวเพื่อถอดถอน

source: Could not find a package with that name to update
th: ไม่สามารถค้นหาแพคเกจชื่อดังกล่าวเพื่ออัปเดต

source: Could not find what packages require this package
th: ไม่สามารถค้นหาแพคเกจที่ต้องการแพคเกจนี้

source: Could not get dependencies for this package
th: ไม่สามารถค้นหารายการพึ่งพาแพคเกจสำหรับแพคเกจนี้

source: Could not find details for this package
th: ไม่สามารถค้นหารายละเอียดแพคเกจนี้

source: You need to specify a search type
th: คุณต้องระบุชนิดการค้นหา

source: PackageKit service
de: PackageKIt-Dienst
th: บริการ PackageKit
